### 3-1 나만의 데이터 만들기

시리즈 만들기

In [57]:
import pandas as pd

In [58]:
s= pd.Series(['banana',42])
s

0    banana
1        42
dtype: object

In [59]:
s= pd.Series(data=['Wes McKinney','Creator of Pandas'],index=['person','who'])
s

person         Wes McKinney
who       Creator of Pandas
dtype: object

데이터 프레임 만들기

In [60]:

scientists=pd.DataFrame({
    'Name':['Franklin','Gosset'],
    'Occupation':['chemist','statistician'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]})
scientists

       Name    Occupation        Born        Died  Age
0  Franklin       chemist  1920-07-25  1958-04-16   37
1    Gosset  statistician  1876-06-13  1937-10-16   61

In [61]:
scientists=pd.DataFrame({
    'Name':['Franklin','Gosset'],
    'Occupation':['chemist','statistician'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]},
    index=['Franklin','Gosset'],
    columns=['Occupation','Born','Died','Age'])
scientists

            Occupation        Born        Died  Age
Franklin       chemist  1920-07-25  1958-04-16   37
Gosset    statistician  1876-06-13  1937-10-16   61

### 3-2 시리즈 다루기

시리즈 추출하기

In [62]:
scientists=pd.DataFrame(data={'Occupation':['chemist','statistician'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]},
    index=['Franklin','Gosset'],
    columns=['Occupation','Born','Died','Age'])
scientists

            Occupation        Born        Died  Age
Franklin       chemist  1920-07-25  1958-04-16   37
Gosset    statistician  1876-06-13  1937-10-16   61

In [63]:
first_row=scientists.loc['Gosset']
print(type(first_row))

<class 'pandas.core.series.Series'>

In [64]:
first_row

Occupation    statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: Gosset, dtype: object

In [65]:
print(first_row.index)
print(first_row.values)

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')
['statistician' '1876-06-13' '1937-10-16' 61]

시리즈의 keys()메서드

In [66]:
# keys() == index속성
first_row.keys()

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [67]:
first_row.index[0]
first_row.keys()[0]

'Occupation'

시리즈의 메서드 사용하기

In [68]:
ages=scientists['Age']
ages

Franklin    37
Gosset      61
Name: Age, dtype: int64

In [69]:
ages.mean()

49.0

In [70]:
ages.min()

37

In [71]:
ages.max()

61

In [72]:
ages.std()

16.97056274847714

In [73]:
file_name=r'C:\Users\KDP-17\EX_PANDAS6\day_03\scientists.csv'
Scientists=pd.read_csv(file_name)

기술 통계량 계산하기

In [74]:
ages=Scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [75]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [76]:
ages.mean()

59.125

In [77]:
ages[ages>ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [78]:
ages>ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [79]:
print(type(ages>ages.mean()))

<class 'pandas.core.series.Series'>

In [80]:
manual_bool_values=[
    True,
    True,
    False,
    False,
    True,
    True,
    False,
    True
]
ages[manual_bool_values]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

벡터와 벡터, 벡터와 스칼라 계산하기

In [81]:
ages+ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [82]:
ages*ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [83]:
ages+100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [84]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [85]:
ages + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [86]:
import numpy as np

In [87]:
# ages+np.array([1,100])

인덱스가 같은 벡터 자동 정렬하기

In [89]:
rev_ages=ages.sort_index(ascending=False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [90]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [91]:
ages+rev_ages # rev_ages가 내림차순으로 정렬 되어 있었어도 연산 후 오름차순으로 자동정렬 된 걸 볼 수 있음

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

### 3-3 데이터프레임 다루기

In [97]:
Scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [94]:
Scientists.index

RangeIndex(start=0, stop=8, step=1)

In [95]:
Scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [96]:
Scientists.values

array([['Rosaline Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Rachel Carson', '1907-05-27', '1964-04-14', 56, 'Biologist'],
       ['John Snow', '1813-03-15', '1858-06-16', 45, 'Physician'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41,
        'Computer Scientist'],
       ['Johann Gauss', '1777-04-30', '1855-02-23', 77, 'Mathematician']],
      dtype=object)

In [98]:
Scientists.loc[Scientists['Age'] > Scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

데이터프레임을 대상으로 연산하기

In [99]:
first_half = Scientists[:4]
second_half = Scientists[4:]
first_half

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [100]:
second_half

            Name        Born        Died  Age          Occupation
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [101]:
Scientists*2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [102]:
df1=df2=pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]])
df_added=df1.add(df2)
df_added

    0   1   2
0   2   4   6
1   8  10  12
2  14  16  18